Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMcds_bf.h
/** \brief Length for Ifx_MCDS_MCXPERFCFG_Bits.DSPR_HIT_EN */
#define IFX_MCDS_MCXPERFCFG_DSPR_HIT_EN_LEN (1u)

/** \brief Mask for Ifx_MCDS_MCXPERFCFG_Bits.DSPR_HIT_EN */
#define IFX_MCDS_MCXPERFCFG_DSPR_HIT_EN_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_MCXPERFCFG_Bits.DSPR_HIT_EN */
#define IFX_MCDS_MCXPERFCFG_DSPR_HIT_EN_OFF (29u)

/** \brief Length for Ifx_MCDS_MCXPERFCFG_Bits.DLMU_HIT_EN */
#define IFX_MCDS_MCXPERFCFG_DLMU_HIT_EN_LEN (1u)

/** \brief Mask for Ifx_MCDS_MCXPERFCFG_Bits.DLMU_HIT_EN */
#define IFX_MCDS_MCXPERFCFG_DLMU_HIT_EN_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_MCXPERFCFG_Bits.DLMU_HIT_EN */
#define IFX_MCDS_MCXPERFCFG_DLMU_HIT_EN_OFF (30u)

/** \brief Length for Ifx_MCDS_TCXDCSTS_Bits.SUS */
#define IFX_MCDS_TCXDCSTS_SUS_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCXDCSTS_Bits.SUS */
#define IFX_MCDS_TCXDCSTS_SUS_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCXDCSTS_Bits.SUS */
#define IFX_MCDS_TCXDCSTS_SUS_OFF (0u)

/** \brief Length for Ifx_MCDS_TCXDCSTS_Bits.IDLE */
#define IFX_MCDS_TCXDCSTS_IDLE_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCXDCSTS_Bits.IDLE */
#define IFX_MCDS_TCXDCSTS_IDLE_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCXDCSTS_Bits.IDLE */
#define IFX_MCDS_TCXDCSTS_IDLE_OFF (1u)

/** \brief Length for Ifx_MCDS_TCXDCSTS_Bits.HALT */
#define IFX_MCDS_TCXDCSTS_HALT_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCXDCSTS_Bits.HALT */
#define IFX_MCDS_TCXDCSTS_HALT_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCXDCSTS_Bits.HALT */
#define IFX_MCDS_TCXDCSTS_HALT_OFF (2u)

/** \brief Length for Ifx_MCDS_TCXDCSTS_Bits.ISR */
#define IFX_MCDS_TCXDCSTS_ISR_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCXDCSTS_Bits.ISR */
#define IFX_MCDS_TCXDCSTS_ISR_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCXDCSTS_Bits.ISR */
#define IFX_MCDS_TCXDCSTS_ISR_OFF (3u)

/** \brief Length for Ifx_MCDS_TCXDCSTS_Bits.HBRK */
#define IFX_MCDS_TCXDCSTS_HBRK_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCXDCSTS_Bits.HBRK */
#define IFX_MCDS_TCXDCSTS_HBRK_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCXDCSTS_Bits.HBRK */
#define IFX_MCDS_TCXDCSTS_HBRK_OFF (4u)

/** \brief Length for Ifx_MCDS_TCXDCSTS_Bits.SBRK */
#define IFX_MCDS_TCXDCSTS_SBRK_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCXDCSTS_Bits.SBRK */
#define IFX_MCDS_TCXDCSTS_SBRK_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCXDCSTS_Bits.SBRK */
#define IFX_MCDS_TCXDCSTS_SBRK_OFF (5u)

/** \brief Length for Ifx_MCDS_TCXDCSTS_Bits.IEN */
#define IFX_MCDS_TCXDCSTS_IEN_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCXDCSTS_Bits.IEN */
#define IFX_MCDS_TCXDCSTS_IEN_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCXDCSTS_Bits.IEN */
#define IFX_MCDS_TCXDCSTS_IEN_OFF (7u)

/** \brief Length for Ifx_MCDS_TCXDCSTS_Bits.DBGEN */
#define IFX_MCDS_TCXDCSTS_DBGEN_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCXDCSTS_Bits.DBGEN */
#define IFX_MCDS_TCXDCSTS_DBGEN_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCXDCSTS_Bits.DBGEN */
#define IFX_MCDS_TCXDCSTS_DBGEN_OFF (8u)

/** \brief Length for Ifx_MCDS_TCXDCSTS_Bits.CLKDIV */
#define IFX_MCDS_TCXDCSTS_CLKDIV_LEN (2u)

/** \brief Mask for Ifx_MCDS_TCXDCSTS_Bits.CLKDIV */
#define IFX_MCDS_TCXDCSTS_CLKDIV_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_TCXDCSTS_Bits.CLKDIV */
#define IFX_MCDS_TCXDCSTS_CLKDIV_OFF (9u)

/** \brief Length for Ifx_MCDS_TCXDCSTS_Bits.NESTED_ISR */
#define IFX_MCDS_TCXDCSTS_NESTED_ISR_LEN (4u)

/** \brief Mask for Ifx_MCDS_TCXDCSTS_Bits.NESTED_ISR */
#define IFX_MCDS_TCXDCSTS_NESTED_ISR_MSK (0xfu)

/** \brief Offset for Ifx_MCDS_TCXDCSTS_Bits.NESTED_ISR */
#define IFX_MCDS_TCXDCSTS_NESTED_ISR_OFF (11u)

/** \brief Length for Ifx_MCDS_TCXCID_Bits.CURRENT */
#define IFX_MCDS_TCXCID_CURRENT_LEN (3u)

/** \brief Mask for Ifx_MCDS_TCXCID_Bits.CURRENT */
#define IFX_MCDS_TCXCID_CURRENT_MSK (0x7u)

/** \brief Offset for Ifx_MCDS_TCXCID_Bits.CURRENT */
#define IFX_MCDS_TCXCID_CURRENT_OFF (0u)

/** \brief Length for Ifx_MCDS_TCXCIP_Bits.CURRENT */
#define IFX_MCDS_TCXCIP_CURRENT_LEN (31u)

/** \brief Mask for Ifx_MCDS_TCXCIP_Bits.CURRENT */
#define IFX_MCDS_TCXCIP_CURRENT_MSK (0x7fffffffu)

/** \brief Offset for Ifx_MCDS_TCXCIP_Bits.CURRENT */
#define IFX_MCDS_TCXCIP_CURRENT_OFF (1u)

/** \brief Length for Ifx_MCDS_TCXCFT_Bits.VSHRT_FCT */
#define IFX_MCDS_TCXCFT_VSHRT_FCT_LEN (10u)

/** \brief Mask for Ifx_MCDS_TCXCFT_Bits.VSHRT_FCT */
#define IFX_MCDS_TCXCFT_VSHRT_FCT_MSK (0x3ffu)

/** \brief Offset for Ifx_MCDS_TCXCFT_Bits.VSHRT_FCT */
#define IFX_MCDS_TCXCFT_VSHRT_FCT_OFF (0u)

/** \brief Length for Ifx_MCDS_TCXCFT_Bits.SHRT_FCT */
#define IFX_MCDS_TCXCFT_SHRT_FCT_LEN (10u)

/** \brief Mask for Ifx_MCDS_TCXCFT_Bits.SHRT_FCT */
#define IFX_MCDS_TCXCFT_SHRT_FCT_MSK (0x3ffu)

/** \brief Offset for Ifx_MCDS_TCXCFT_Bits.SHRT_FCT */
#define IFX_MCDS_TCXCFT_SHRT_FCT_OFF (16u)

/** \brief Length for Ifx_MCDS_TCXPALLUTD_Bits.DATA */
#define IFX_MCDS_TCXPALLUTD_DATA_LEN (32u)

/** \brief Mask for Ifx_MCDS_TCXPALLUTD_Bits.DATA */
#define IFX_MCDS_TCXPALLUTD_DATA_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_TCXPALLUTD_Bits.DATA */
#define IFX_MCDS_TCXPALLUTD_DATA_OFF (0u)

/** \brief Length for Ifx_MCDS_TCXPALLUTA_Bits.ADDR */
#define IFX_MCDS_TCXPALLUTA_ADDR_LEN (10u)

/** \brief Mask for Ifx_MCDS_TCXPALLUTA_Bits.ADDR */
#define IFX_MCDS_TCXPALLUTA_ADDR_MSK (0x3ffu)

/** \brief Offset for Ifx_MCDS_TCXPALLUTA_Bits.ADDR */
#define IFX_MCDS_TCXPALLUTA_ADDR_OFF (2u)

/** \brief Length for Ifx_MCDS_TCXPAL_BND_Bits.BOUND */
#define IFX_MCDS_TCXPAL_BND_BOUND_LEN (32u)

/** \brief Mask for Ifx_MCDS_TCXPAL_BND_Bits.BOUND */
#define IFX_MCDS_TCXPAL_BND_BOUND_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_TCXPAL_BND_Bits.BOUND */
#define IFX_MCDS_TCXPAL_BND_BOUND_OFF (0u)

/** \brief Length for Ifx_MCDS_TCXPAL_RNG_Bits.RANGE */
#define IFX_MCDS_TCXPAL_RNG_RANGE_LEN (32u)

/** \brief Mask for Ifx_MCDS_TCXPAL_RNG_Bits.RANGE */
#define IFX_MCDS_TCXPAL_RNG_RANGE_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_TCXPAL_RNG_Bits.RANGE */
#define IFX_MCDS_TCXPAL_RNG_RANGE_OFF (0u)

/** \brief Length for Ifx_MCDS_TCXPAL_MAP_Bits.OFFSET */
#define IFX_MCDS_TCXPAL_MAP_OFFSET_LEN (10u)

/** \brief Mask for Ifx_MCDS_TCXPAL_MAP_Bits.OFFSET */
#define IFX_MCDS_TCXPAL_MAP_OFFSET_MSK (0x3ffu)

/** \brief Offset for Ifx_MCDS_TCXPAL_MAP_Bits.OFFSET */
#define IFX_MCDS_TCXPAL_MAP_OFFSET_OFF (5u)

