Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMcds_bf.h
/** \brief Offset for Ifx_MCDS_TCYDCSTS_Bits.CLKDIV */
#define IFX_MCDS_TCYDCSTS_CLKDIV_OFF (9u)

/** \brief Length for Ifx_MCDS_TCYDCSTS_Bits.NESTED_ISR */
#define IFX_MCDS_TCYDCSTS_NESTED_ISR_LEN (4u)

/** \brief Mask for Ifx_MCDS_TCYDCSTS_Bits.NESTED_ISR */
#define IFX_MCDS_TCYDCSTS_NESTED_ISR_MSK (0xfu)

/** \brief Offset for Ifx_MCDS_TCYDCSTS_Bits.NESTED_ISR */
#define IFX_MCDS_TCYDCSTS_NESTED_ISR_OFF (11u)

/** \brief Length for Ifx_MCDS_TCYCID_Bits.CURRENT */
#define IFX_MCDS_TCYCID_CURRENT_LEN (3u)

/** \brief Mask for Ifx_MCDS_TCYCID_Bits.CURRENT */
#define IFX_MCDS_TCYCID_CURRENT_MSK (0x7u)

/** \brief Offset for Ifx_MCDS_TCYCID_Bits.CURRENT */
#define IFX_MCDS_TCYCID_CURRENT_OFF (0u)

/** \brief Length for Ifx_MCDS_TCYCIP_Bits.CURRENT */
#define IFX_MCDS_TCYCIP_CURRENT_LEN (31u)

/** \brief Mask for Ifx_MCDS_TCYCIP_Bits.CURRENT */
#define IFX_MCDS_TCYCIP_CURRENT_MSK (0x7fffffffu)

/** \brief Offset for Ifx_MCDS_TCYCIP_Bits.CURRENT */
#define IFX_MCDS_TCYCIP_CURRENT_OFF (1u)

/** \brief Length for Ifx_MCDS_TCYCFT_Bits.VSHRT_FCT */
#define IFX_MCDS_TCYCFT_VSHRT_FCT_LEN (10u)

/** \brief Mask for Ifx_MCDS_TCYCFT_Bits.VSHRT_FCT */
#define IFX_MCDS_TCYCFT_VSHRT_FCT_MSK (0x3ffu)

/** \brief Offset for Ifx_MCDS_TCYCFT_Bits.VSHRT_FCT */
#define IFX_MCDS_TCYCFT_VSHRT_FCT_OFF (0u)

/** \brief Length for Ifx_MCDS_TCYCFT_Bits.SHRT_FCT */
#define IFX_MCDS_TCYCFT_SHRT_FCT_LEN (10u)

/** \brief Mask for Ifx_MCDS_TCYCFT_Bits.SHRT_FCT */
#define IFX_MCDS_TCYCFT_SHRT_FCT_MSK (0x3ffu)

/** \brief Offset for Ifx_MCDS_TCYCFT_Bits.SHRT_FCT */
#define IFX_MCDS_TCYCFT_SHRT_FCT_OFF (16u)

/** \brief Length for Ifx_MCDS_TCYPALLUTD_Bits.DATA */
#define IFX_MCDS_TCYPALLUTD_DATA_LEN (32u)

/** \brief Mask for Ifx_MCDS_TCYPALLUTD_Bits.DATA */
#define IFX_MCDS_TCYPALLUTD_DATA_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_TCYPALLUTD_Bits.DATA */
#define IFX_MCDS_TCYPALLUTD_DATA_OFF (0u)

/** \brief Length for Ifx_MCDS_TCYPALLUTA_Bits.ADDR */
#define IFX_MCDS_TCYPALLUTA_ADDR_LEN (10u)

/** \brief Mask for Ifx_MCDS_TCYPALLUTA_Bits.ADDR */
#define IFX_MCDS_TCYPALLUTA_ADDR_MSK (0x3ffu)

/** \brief Offset for Ifx_MCDS_TCYPALLUTA_Bits.ADDR */
#define IFX_MCDS_TCYPALLUTA_ADDR_OFF (2u)

/** \brief Length for Ifx_MCDS_TCYPAL_BND_Bits.BOUND */
#define IFX_MCDS_TCYPAL_BND_BOUND_LEN (32u)

/** \brief Mask for Ifx_MCDS_TCYPAL_BND_Bits.BOUND */
#define IFX_MCDS_TCYPAL_BND_BOUND_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_TCYPAL_BND_Bits.BOUND */
#define IFX_MCDS_TCYPAL_BND_BOUND_OFF (0u)

/** \brief Length for Ifx_MCDS_TCYPAL_RNG_Bits.RANGE */
#define IFX_MCDS_TCYPAL_RNG_RANGE_LEN (32u)

/** \brief Mask for Ifx_MCDS_TCYPAL_RNG_Bits.RANGE */
#define IFX_MCDS_TCYPAL_RNG_RANGE_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_TCYPAL_RNG_Bits.RANGE */
#define IFX_MCDS_TCYPAL_RNG_RANGE_OFF (0u)

/** \brief Length for Ifx_MCDS_TCYPAL_MAP_Bits.OFFSET */
#define IFX_MCDS_TCYPAL_MAP_OFFSET_LEN (10u)

/** \brief Mask for Ifx_MCDS_TCYPAL_MAP_Bits.OFFSET */
#define IFX_MCDS_TCYPAL_MAP_OFFSET_MSK (0x3ffu)

/** \brief Offset for Ifx_MCDS_TCYPAL_MAP_Bits.OFFSET */
#define IFX_MCDS_TCYPAL_MAP_OFFSET_OFF (5u)

/** \brief Length for Ifx_MCDS_TCYPAL_MAP_Bits.GRAIN */
#define IFX_MCDS_TCYPAL_MAP_GRAIN_LEN (3u)

/** \brief Mask for Ifx_MCDS_TCYPAL_MAP_Bits.GRAIN */
#define IFX_MCDS_TCYPAL_MAP_GRAIN_MSK (0x7u)

/** \brief Offset for Ifx_MCDS_TCYPAL_MAP_Bits.GRAIN */
#define IFX_MCDS_TCYPAL_MAP_GRAIN_OFF (28u)

/** \brief Length for Ifx_MCDS_TCYPAL_MAP_Bits.EN */
#define IFX_MCDS_TCYPAL_MAP_EN_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCYPAL_MAP_Bits.EN */
#define IFX_MCDS_TCYPAL_MAP_EN_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCYPAL_MAP_Bits.EN */
#define IFX_MCDS_TCYPAL_MAP_EN_OFF (31u)

/** \brief Length for Ifx_MCDS_TCYEA_BND_Bits.BOUND */
#define IFX_MCDS_TCYEA_BND_BOUND_LEN (32u)

/** \brief Mask for Ifx_MCDS_TCYEA_BND_Bits.BOUND */
#define IFX_MCDS_TCYEA_BND_BOUND_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_TCYEA_BND_Bits.BOUND */
#define IFX_MCDS_TCYEA_BND_BOUND_OFF (0u)

/** \brief Length for Ifx_MCDS_TCYEA_RNG_Bits.RANGE */
#define IFX_MCDS_TCYEA_RNG_RANGE_LEN (32u)

/** \brief Mask for Ifx_MCDS_TCYEA_RNG_Bits.RANGE */
#define IFX_MCDS_TCYEA_RNG_RANGE_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_TCYEA_RNG_Bits.RANGE */
#define IFX_MCDS_TCYEA_RNG_RANGE_OFF (0u)

/** \brief Length for Ifx_MCDS_TCYWD_BND_Bits.BOUND_31_0 */
#define IFX_MCDS_TCYWD_BND_BOUND_31_0_LEN (32u)

/** \brief Mask for Ifx_MCDS_TCYWD_BND_Bits.BOUND_31_0 */
#define IFX_MCDS_TCYWD_BND_BOUND_31_0_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_TCYWD_BND_Bits.BOUND_31_0 */
#define IFX_MCDS_TCYWD_BND_BOUND_31_0_OFF (0u)

/** \brief Length for Ifx_MCDS_TCYWD_HBND_Bits.BOUND_63_32 */
#define IFX_MCDS_TCYWD_HBND_BOUND_63_32_LEN (32u)

/** \brief Mask for Ifx_MCDS_TCYWD_HBND_Bits.BOUND_63_32 */
#define IFX_MCDS_TCYWD_HBND_BOUND_63_32_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_TCYWD_HBND_Bits.BOUND_63_32 */
#define IFX_MCDS_TCYWD_HBND_BOUND_63_32_OFF (0u)

/** \brief Length for Ifx_MCDS_TCYWD_RNG_Bits.RANGE_31_0 */
#define IFX_MCDS_TCYWD_RNG_RANGE_31_0_LEN (32u)

/** \brief Mask for Ifx_MCDS_TCYWD_RNG_Bits.RANGE_31_0 */
#define IFX_MCDS_TCYWD_RNG_RANGE_31_0_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_TCYWD_RNG_Bits.RANGE_31_0 */
#define IFX_MCDS_TCYWD_RNG_RANGE_31_0_OFF (0u)

/** \brief Length for Ifx_MCDS_TCYWD_HRNG_Bits.RANGE_63_32 */
#define IFX_MCDS_TCYWD_HRNG_RANGE_63_32_LEN (32u)

/** \brief Mask for Ifx_MCDS_TCYWD_HRNG_Bits.RANGE_63_32 */
#define IFX_MCDS_TCYWD_HRNG_RANGE_63_32_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_TCYWD_HRNG_Bits.RANGE_63_32 */
#define IFX_MCDS_TCYWD_HRNG_RANGE_63_32_OFF (0u)

/** \brief Length for Ifx_MCDS_TCYWD_MSK_Bits.MASK_31_0 */
#define IFX_MCDS_TCYWD_MSK_MASK_31_0_LEN (32u)

/** \brief Mask for Ifx_MCDS_TCYWD_MSK_Bits.MASK_31_0 */
#define IFX_MCDS_TCYWD_MSK_MASK_31_0_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_TCYWD_MSK_Bits.MASK_31_0 */
#define IFX_MCDS_TCYWD_MSK_MASK_31_0_OFF (0u)

/** \brief Length for Ifx_MCDS_TCYWD_HMSK_Bits.MASK_63_32 */
#define IFX_MCDS_TCYWD_HMSK_MASK_63_32_LEN (32u)

/** \brief Mask for Ifx_MCDS_TCYWD_HMSK_Bits.MASK_63_32 */
#define IFX_MCDS_TCYWD_HMSK_MASK_63_32_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_TCYWD_HMSK_Bits.MASK_63_32 */
#define IFX_MCDS_TCYWD_HMSK_MASK_63_32_OFF (0u)

/** \brief Length for Ifx_MCDS_TCYWD_SGN_Bits.SIGN */
#define IFX_MCDS_TCYWD_SGN_SIGN_LEN (6u)

/** \brief Mask for Ifx_MCDS_TCYWD_SGN_Bits.SIGN */
#define IFX_MCDS_TCYWD_SGN_SIGN_MSK (0x3fu)

