Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMcds_bf.h
/** \brief Offset for Ifx_MCDS_TCZAC_MSK_Bits.WR */
#define IFX_MCDS_TCZAC_MSK_WR_OFF (12u)

/** \brief Length for Ifx_MCDS_TCZAC_MSK_Bits.RD */
#define IFX_MCDS_TCZAC_MSK_RD_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCZAC_MSK_Bits.RD */
#define IFX_MCDS_TCZAC_MSK_RD_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCZAC_MSK_Bits.RD */
#define IFX_MCDS_TCZAC_MSK_RD_OFF (13u)

/** \brief Length for Ifx_MCDS_TCZAC_MSK_Bits.MSK */
#define IFX_MCDS_TCZAC_MSK_MSK_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCZAC_MSK_Bits.MSK */
#define IFX_MCDS_TCZAC_MSK_MSK_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCZAC_MSK_Bits.MSK */
#define IFX_MCDS_TCZAC_MSK_MSK_OFF (14u)

/** \brief Length for Ifx_MCDS_TCZDTUFLV_Bits.CURLVL0 */
#define IFX_MCDS_TCZDTUFLV_CURLVL0_LEN (4u)

/** \brief Mask for Ifx_MCDS_TCZDTUFLV_Bits.CURLVL0 */
#define IFX_MCDS_TCZDTUFLV_CURLVL0_MSK (0xfu)

/** \brief Offset for Ifx_MCDS_TCZDTUFLV_Bits.CURLVL0 */
#define IFX_MCDS_TCZDTUFLV_CURLVL0_OFF (0u)

/** \brief Length for Ifx_MCDS_TCZDTUFLV_Bits.MAXLVL0 */
#define IFX_MCDS_TCZDTUFLV_MAXLVL0_LEN (4u)

/** \brief Mask for Ifx_MCDS_TCZDTUFLV_Bits.MAXLVL0 */
#define IFX_MCDS_TCZDTUFLV_MAXLVL0_MSK (0xfu)

/** \brief Offset for Ifx_MCDS_TCZDTUFLV_Bits.MAXLVL0 */
#define IFX_MCDS_TCZDTUFLV_MAXLVL0_OFF (4u)

/** \brief Length for Ifx_MCDS_TCZDTUFLV_Bits.CURLVL1 */
#define IFX_MCDS_TCZDTUFLV_CURLVL1_LEN (4u)

/** \brief Mask for Ifx_MCDS_TCZDTUFLV_Bits.CURLVL1 */
#define IFX_MCDS_TCZDTUFLV_CURLVL1_MSK (0xfu)

/** \brief Offset for Ifx_MCDS_TCZDTUFLV_Bits.CURLVL1 */
#define IFX_MCDS_TCZDTUFLV_CURLVL1_OFF (8u)

/** \brief Length for Ifx_MCDS_TCZDTUFLV_Bits.MAXLVL1 */
#define IFX_MCDS_TCZDTUFLV_MAXLVL1_LEN (4u)

/** \brief Mask for Ifx_MCDS_TCZDTUFLV_Bits.MAXLVL1 */
#define IFX_MCDS_TCZDTUFLV_MAXLVL1_MSK (0xfu)

/** \brief Offset for Ifx_MCDS_TCZDTUFLV_Bits.MAXLVL1 */
#define IFX_MCDS_TCZDTUFLV_MAXLVL1_OFF (12u)

/** \brief Length for Ifx_MCDS_TCZEVT_Bits.EIQ0 */
#define IFX_MCDS_TCZEVT_EIQ0_LEN (2u)

/** \brief Mask for Ifx_MCDS_TCZEVT_Bits.EIQ0 */
#define IFX_MCDS_TCZEVT_EIQ0_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_TCZEVT_Bits.EIQ0 */
#define IFX_MCDS_TCZEVT_EIQ0_OFF (0u)

/** \brief Length for Ifx_MCDS_TCZEVT_Bits.EIQ1 */
#define IFX_MCDS_TCZEVT_EIQ1_LEN (2u)

/** \brief Mask for Ifx_MCDS_TCZEVT_Bits.EIQ1 */
#define IFX_MCDS_TCZEVT_EIQ1_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_TCZEVT_Bits.EIQ1 */
#define IFX_MCDS_TCZEVT_EIQ1_OFF (2u)

/** \brief Length for Ifx_MCDS_TCZEVT_Bits.EIQ2 */
#define IFX_MCDS_TCZEVT_EIQ2_LEN (2u)

/** \brief Mask for Ifx_MCDS_TCZEVT_Bits.EIQ2 */
#define IFX_MCDS_TCZEVT_EIQ2_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_TCZEVT_Bits.EIQ2 */
#define IFX_MCDS_TCZEVT_EIQ2_OFF (4u)

/** \brief Length for Ifx_MCDS_TCZEVT_Bits.EIQ3 */
#define IFX_MCDS_TCZEVT_EIQ3_LEN (2u)

/** \brief Mask for Ifx_MCDS_TCZEVT_Bits.EIQ3 */
#define IFX_MCDS_TCZEVT_EIQ3_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_TCZEVT_Bits.EIQ3 */
#define IFX_MCDS_TCZEVT_EIQ3_OFF (6u)

/** \brief Length for Ifx_MCDS_TCZEVT_Bits.EIQ4 */
#define IFX_MCDS_TCZEVT_EIQ4_LEN (2u)

/** \brief Mask for Ifx_MCDS_TCZEVT_Bits.EIQ4 */
#define IFX_MCDS_TCZEVT_EIQ4_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_TCZEVT_Bits.EIQ4 */
#define IFX_MCDS_TCZEVT_EIQ4_OFF (8u)

/** \brief Length for Ifx_MCDS_TCZEVT_Bits.EIQ5 */
#define IFX_MCDS_TCZEVT_EIQ5_LEN (2u)

/** \brief Mask for Ifx_MCDS_TCZEVT_Bits.EIQ5 */
#define IFX_MCDS_TCZEVT_EIQ5_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_TCZEVT_Bits.EIQ5 */
#define IFX_MCDS_TCZEVT_EIQ5_OFF (10u)

/** \brief Length for Ifx_MCDS_TCZEVT_Bits.EIQ6 */
#define IFX_MCDS_TCZEVT_EIQ6_LEN (2u)

/** \brief Mask for Ifx_MCDS_TCZEVT_Bits.EIQ6 */
#define IFX_MCDS_TCZEVT_EIQ6_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_TCZEVT_Bits.EIQ6 */
#define IFX_MCDS_TCZEVT_EIQ6_OFF (12u)

/** \brief Length for Ifx_MCDS_TCZEVT_Bits.EIQ7 */
#define IFX_MCDS_TCZEVT_EIQ7_LEN (2u)

/** \brief Mask for Ifx_MCDS_TCZEVT_Bits.EIQ7 */
#define IFX_MCDS_TCZEVT_EIQ7_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_TCZEVT_Bits.EIQ7 */
#define IFX_MCDS_TCZEVT_EIQ7_OFF (14u)

/** \brief Length for Ifx_MCDS_TCZEVT_Bits.EIQ8 */
#define IFX_MCDS_TCZEVT_EIQ8_LEN (2u)

/** \brief Mask for Ifx_MCDS_TCZEVT_Bits.EIQ8 */
#define IFX_MCDS_TCZEVT_EIQ8_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_TCZEVT_Bits.EIQ8 */
#define IFX_MCDS_TCZEVT_EIQ8_OFF (16u)

/** \brief Length for Ifx_MCDS_TCZEVT_Bits.EIQ9 */
#define IFX_MCDS_TCZEVT_EIQ9_LEN (2u)

/** \brief Mask for Ifx_MCDS_TCZEVT_Bits.EIQ9 */
#define IFX_MCDS_TCZEVT_EIQ9_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_TCZEVT_Bits.EIQ9 */
#define IFX_MCDS_TCZEVT_EIQ9_OFF (18u)

/** \brief Length for Ifx_MCDS_TCZEVT_Bits.EIQ10 */
#define IFX_MCDS_TCZEVT_EIQ10_LEN (2u)

/** \brief Mask for Ifx_MCDS_TCZEVT_Bits.EIQ10 */
#define IFX_MCDS_TCZEVT_EIQ10_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_TCZEVT_Bits.EIQ10 */
#define IFX_MCDS_TCZEVT_EIQ10_OFF (20u)

/** \brief Length for Ifx_MCDS_TCZEVT_Bits.EIQ11 */
#define IFX_MCDS_TCZEVT_EIQ11_LEN (2u)

/** \brief Mask for Ifx_MCDS_TCZEVT_Bits.EIQ11 */
#define IFX_MCDS_TCZEVT_EIQ11_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_TCZEVT_Bits.EIQ11 */
#define IFX_MCDS_TCZEVT_EIQ11_OFF (22u)

/** \brief Length for Ifx_MCDS_TCZEVT_Bits.EIQ12 */
#define IFX_MCDS_TCZEVT_EIQ12_LEN (2u)

/** \brief Mask for Ifx_MCDS_TCZEVT_Bits.EIQ12 */
#define IFX_MCDS_TCZEVT_EIQ12_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_TCZEVT_Bits.EIQ12 */
#define IFX_MCDS_TCZEVT_EIQ12_OFF (24u)

/** \brief Length for Ifx_MCDS_TCZEVT_Bits.EIQ13 */
#define IFX_MCDS_TCZEVT_EIQ13_LEN (2u)

/** \brief Mask for Ifx_MCDS_TCZEVT_Bits.EIQ13 */
#define IFX_MCDS_TCZEVT_EIQ13_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_TCZEVT_Bits.EIQ13 */
#define IFX_MCDS_TCZEVT_EIQ13_OFF (26u)

/** \brief Length for Ifx_MCDS_TCZEVT_Bits.EIQ14 */
#define IFX_MCDS_TCZEVT_EIQ14_LEN (2u)

/** \brief Mask for Ifx_MCDS_TCZEVT_Bits.EIQ14 */
#define IFX_MCDS_TCZEVT_EIQ14_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_TCZEVT_Bits.EIQ14 */
#define IFX_MCDS_TCZEVT_EIQ14_OFF (28u)

/** \brief Length for Ifx_MCDS_TCZEVT_Bits.EIQ15 */
#define IFX_MCDS_TCZEVT_EIQ15_LEN (2u)

